<template>
  <div class="settings">
    <span @click="toggleVisibility">&#8505;</span>
    <div v-if="visible" class="fixed-full-page">
      <div class="container">
        <h3>Информация <span class="close" @click="toggleVisibility">&#x2715;</span></h3>
        <ul>
          <li>
            Верно / Неверно
            <ul>
              <li>Вам последовательно показываются уравнения. Ваша задача определить, является ли уравнение верным (тождеством).</li>
              <li>Для ответа можно использовать кнопки на странице под вопросом.</li>
              <li>Также можно использовать кнопки клавиатуры для ответа: стрелка влево - Верно, вправо - неверно.</li>
            </ul>
          </li>
          <li>
            Дай ответ
            <ul>
              <li>Вам последовательно показываются уравнения, в которых не хватает одного числа. Ваша задача найти неизвестное.</li>
              <li>Для введения числа используйте клавиатуру.</li>
              <li>Для ответа можно использовать кнопки на странице под вопросом. Кнопки проверки введенного ответа и переход к новому вопросу.</li>
              <li>Также можно использовать кнопки клавиатуры для ответа: Enter - проверить ответ, Esc - следующий вопрос.</li>
            </ul>
          </li>
        </ul>
      </div>
    </div>
  </div>

</template>

<script>
export default {
  name: "Info",
  data(){
    return{
      visible: false,
    }
  },
  methods:{
    toggleVisibility() {
      this.visible = !this.visible;
    },
  }
}
</script>