<template>
  <div class="row">
    <div class="col text-center">
      <h2>Информация</h2>
    </div>
    <div class="col-12">
      <h3>Верно / Неверно</h3>
      <ul class="list-group">
        <li class="list-group-item">Вам последовательно показываются уравнения. Ваша задача определить, является ли
          уравнение верным
          (тождеством).
        </li>
        <li class="list-group-item">Для ответа можно использовать кнопки на странице под вопросом.</li>
        <li class="list-group-item">Также можно использовать кнопки клавиатуры для ответа: стрелка влево - Верно, вправо
          - неверно.
        </li>
      </ul>
    </div>
    <div class="col-12">
      <h3>Дай ответ</h3>
      <ul class="list-group">
        <li class="list-group-item">Вам последовательно показываются уравнения, в которых не хватает одного числа. Ваша
          задача найти
          неизвестное.
        </li>
        <li class="list-group-item">Для введения числа используйте клавиатуру.</li>
        <li class="list-group-item">Для ответа можно использовать кнопки на странице под вопросом. Кнопки проверки
          введенного ответа и переход к
          новому вопросу.
        </li>
        <li class="list-group-item">Также можно использовать кнопки клавиатуры для ответа: Enter - проверить ответ, Esc
          - следующий вопрос.
        </li>
      </ul>
    </div>
  </div>

</template>

<script>
export default {
  name: "Info"
}
</script>